In [1]:
import pandas as pd

In [12]:
df_one = pd.DataFrame(columns=["col_1", "col_2"])

df_one

Empty DataFrame
Columns: [col_1, col_2]
Index: []

In [13]:
df_one.columns = ["im_changing_col_1", "other_col_2_name"]

df_one

Empty DataFrame
Columns: [im_changing_col_1, other_col_2_name]
Index: []

In [17]:
new_data = {
    "First": [1,2,"foo"],
    "Second": [3,4, "bar"]
}

def_two = pd.DataFrame(new_data)

def_two

  First Second
0     1      3
1     2      4
2   foo    bar

In [22]:
# Adding df together (row-wise)
data_for_one = {
    "First": [5,6,"hello"],
    "Second": [7,8, "world"]
}

df_one = pd.DataFrame(data_for_one)
df_combined = pd.concat([df_one, def_two])
df_combined.reset_index(drop=True, inplace=True)

df_combined

   First Second
0      5      7
1      6      8
2  hello  world
3      1      3
4      2      4
5    foo    bar

In [23]:
# Adding df together (wise-wise)
column_data = {
    "SeconThirdd": ["a", "b", "c"]
}

df_three = pd.DataFrame(column_data)
df_combined_v2 = pd.concat([df_combined, df_three], axis=1)

df_combined_v2

   First Second SeconThirdd
0      5      7           a
1      6      8           b
2  hello  world           c
3      1      3         NaN
4      2      4         NaN
5    foo    bar         NaN